<a href="https://colab.research.google.com/github/anirudh4git/Zomato-Review-Sentniment-Analysis/blob/main/ZOMATO__RESTAURANT_CLUSTERING_%26_SENTIMENT_ANALYSIS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Problem Statement**

Zomato is an Indian restaurant aggregator and food delivery start-up founded by Deepinder Goyal and Pankaj Chaddah in 2008. Zomato provides information, menus and user-reviews of restaurants, and also has food delivery options from partner restaurants in select cities.

India is quite famous for its diverse multi cuisine available in a large number of restaurants and hotel resorts, which is reminiscent of unity in diversity. Restaurant business in India is always evolving. More Indians are warming up to the idea of eating restaurant food whether by dining outside or getting food delivered. The growing number of restaurants in every state of India has been a motivation to inspect the data to get some insights, interesting facts and figures about the Indian food industry in each city. So, this project focuses on analysing the Zomato restaurant data for each city in India.

The Project focuses on Customers and Company, you have  to analyze the sentiments of the reviews given by the customer in the data and made some useful conclusion in the form of Visualizations. Also, cluster the zomato restaurants into different segments. The data is vizualized as it becomes easy to analyse data at instant. The Analysis also solve some of the business cases that can directly help the customers finding the Best restaurant in their locality and for the company to grow up and work on the fields they are currently lagging in.

This could help in clustering the restaurants into segments. Also the data has valuable information around cuisine and costing which can be used in cost vs. benefit analysis

Data could be used for sentiment analysis. Also the metadata of reviewers can be used for identifying the critics in the industry.

# **Attribute Information**

## **Zomato Restaurant names and Metadata**
Use this dataset for clustering part

1. Name : Name of Restaurants

2. Links : URL Links of Restaurants

3. Cost : Per person estimated Cost of dining

4. Collection : Tagging of Restaurants w.r.t. Zomato categories

5. Cuisines : Cuisines served by Restaurants

6. Timings : Restaurant Timings

## **Zomato Restaurant reviews**
Merge this dataset with Names and Matadata and then use for sentiment analysis part

1. Restaurant : Name of the Restaurant

2. Reviewer : Name of the Reviewer

3. Review : Review Text

4. Rating : Rating Provided by Reviewer

5. MetaData : Reviewer Metadata - No. of Reviews and followers

6. Time: Date and Time of Review

7. Pictures : No. of pictures posted with review

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
df_rest = pd.read_csv('/content/drive/MyDrive/AlmaBetter/Capstone - ML- Zomato Sentiment Analysis/Zomato Restaurant names and Metadata.csv')

In [4]:
df_reviews = pd.read_csv('/content/drive/MyDrive/AlmaBetter/Capstone - ML- Zomato Sentiment Analysis/Zomato Restaurant reviews.csv')

In [5]:
df_rest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         105 non-null    object
 1   Links        105 non-null    object
 2   Cost         105 non-null    object
 3   Collections  51 non-null     object
 4   Cuisines     105 non-null    object
 5   Timings      104 non-null    object
dtypes: object(6)
memory usage: 5.0+ KB

In [6]:
df_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Restaurant  10000 non-null  object
 1   Reviewer    9962 non-null   object
 2   Review      9955 non-null   object
 3   Rating      9962 non-null   object
 4   Metadata    9962 non-null   object
 5   Time        9962 non-null   object
 6   Pictures    10000 non-null  int64
dtypes: int64(1), object(6)
memory usage: 547.0+ KB

In [7]:
df_rest.head()

                             Name  ...                                            Timings
0                 Beyond Flavours  ...      12noon to 3:30pm, 6:30pm to 11:30pm (Mon-Sun)
1                        Paradise  ...                                     11 AM to 11 PM
2                        Flechazo  ...              11:30 AM to 4:30 PM, 6:30 PM to 11 PM
3  Shah Ghouse Hotel & Restaurant  ...                                    12 Noon to 2 AM
4      Over The Moon Brew Company  ...  12noon to 11pm (Mon, Tue, Wed, Thu, Sun), 12no...

[5 rows x 6 columns]

In [9]:
type(df_rest['Cuisines'][0])

str

In [10]:
df_rest.shape

(105, 6)

In [17]:
from ast import literal_eval

In [18]:
literal_eval('['+df_rest['Cuisines'][0]+']')

SyntaxError: ignored

In [7]:
df_rest['Cuisines'][0]

'Chinese, Continental, Kebab, European, South Indian, North Indian'

In [8]:
df_rest['Collections']

0      Food Hygiene Rated Restaurants in Hyderabad, C...
1                                    Hyderabad's Hottest
2                     Great Buffets, Hyderabad's Hottest
3                                 Late Night Restaurants
4      Best Bars & Pubs, Food Hygiene Rated Restauran...
                             ...
100                                                  NaN
101                                                  NaN
102                                                  NaN
103                                                  NaN
104                                 Pan-Asian Delicacies
Name: Collections, Length: 105, dtype: object

In [9]:
df_rest['Timings']

0          12noon to 3:30pm, 6:30pm to 11:30pm (Mon-Sun)
1                                         11 AM to 11 PM
2                  11:30 AM to 4:30 PM, 6:30 PM to 11 PM
3                                        12 Noon to 2 AM
4      12noon to 11pm (Mon, Tue, Wed, Thu, Sun), 12no...
                             ...
100                                       11 AM to 11 PM
101    10 AM to 10 PM (Mon-Thu), 8 AM to 10:30 PM (Fr...
102                                     12 Noon to 11 PM
103                             8am to 12:30AM (Mon-Sun)
104                11:30 AM to 3 PM, 7 PM to 12 Midnight
Name: Timings, Length: 105, dtype: object

In [10]:
df_reviews.head()

        Restaurant              Reviewer  ...             Time Pictures
0  Beyond Flavours     Rusha Chakraborty  ...  5/25/2019 15:54        0
1  Beyond Flavours  Anusha Tirumalaneedi  ...  5/25/2019 14:20        0
2  Beyond Flavours       Ashok Shekhawat  ...  5/24/2019 22:54        0
3  Beyond Flavours        Swapnil Sarkar  ...  5/24/2019 22:11        0
4  Beyond Flavours                Dileep  ...  5/24/2019 21:37        0

[5 rows x 7 columns]

In [13]:
len(df_reviews['Restaurant'].unique())

100

In [14]:
len(df_rest['Name'].unique())

105

In [5]:
df_rest.head()

                             Name  ...                                            Timings
0                 Beyond Flavours  ...      12noon to 3:30pm, 6:30pm to 11:30pm (Mon-Sun)
1                        Paradise  ...                                     11 AM to 11 PM
2                        Flechazo  ...              11:30 AM to 4:30 PM, 6:30 PM to 11 PM
3  Shah Ghouse Hotel & Restaurant  ...                                    12 Noon to 2 AM
4      Over The Moon Brew Company  ...  12noon to 11pm (Mon, Tue, Wed, Thu, Sun), 12no...

[5 rows x 6 columns]

## We are going to drop the Links Column because no info is provided relative to the project.

In [7]:
df_rest.drop('Links',axis=1,inplace = True)

In [8]:
df_rest.head()

                             Name  ...                                            Timings
0                 Beyond Flavours  ...      12noon to 3:30pm, 6:30pm to 11:30pm (Mon-Sun)
1                        Paradise  ...                                     11 AM to 11 PM
2                        Flechazo  ...              11:30 AM to 4:30 PM, 6:30 PM to 11 PM
3  Shah Ghouse Hotel & Restaurant  ...                                    12 Noon to 2 AM
4      Over The Moon Brew Company  ...  12noon to 11pm (Mon, Tue, Wed, Thu, Sun), 12no...

[5 rows x 5 columns]

## We are also going to drop the Collections column as more than 50% of data is null.

In [ ]:
df_rest[~df_rest['Collections'].isna()]

In [13]:
df_rest.drop('Collections',axis=1,inplace=True)

In [14]:
df_rest.head()

                             Name  ...                                            Timings
0                 Beyond Flavours  ...      12noon to 3:30pm, 6:30pm to 11:30pm (Mon-Sun)
1                        Paradise  ...                                     11 AM to 11 PM
2                        Flechazo  ...              11:30 AM to 4:30 PM, 6:30 PM to 11 PM
3  Shah Ghouse Hotel & Restaurant  ...                                    12 Noon to 2 AM
4      Over The Moon Brew Company  ...  12noon to 11pm (Mon, Tue, Wed, Thu, Sun), 12no...

[5 rows x 4 columns]

In [ ]:
df_rest['Timings'].unique()

## We are going to drop the timing Cols also as All the restaurants seem to be open for the similar timings.

In [19]:
df_rest.drop('Timings',axis=1,inplace=True)

In [20]:
df_rest.head()

                             Name  ...                                           Cuisines
0                 Beyond Flavours  ...  Chinese, Continental, Kebab, European, South I...
1                        Paradise  ...                     Biryani, North Indian, Chinese
2                        Flechazo  ...       Asian, Mediterranean, North Indian, Desserts
3  Shah Ghouse Hotel & Restaurant  ...  Biryani, North Indian, Chinese, Seafood, Bever...
4      Over The Moon Brew Company  ...  Asian, Continental, North Indian, Chinese, Med...

[5 rows x 3 columns]

In [21]:
df_rest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      105 non-null    object
 1   Cost      105 non-null    object
 2   Cuisines  105 non-null    object
dtypes: object(3)
memory usage: 2.6+ KB

## There are no null values present now, we can start with some data preprocessing.